Requests_control/src/InformationRegisters/КешИнформацииОбОбъектах/КешИнформацииОбОбъектах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КешИнформацииОбОбъектах</name>
  <resources>
    <name>ДатаПроверкиЭП</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьЗадачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатусЭП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Requests_control/src/Catalogs/Обращения/Обращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Обращения</name>
  <attributes>
    <name>ВидОбращения</name>
    <type>
      <types>CatalogRef.ВидыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсеВопросыНаРассмотрении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоОбращению</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Заявители</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ОрганыИУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбратившихся</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНумерации</name>
    <type>
      <types>EnumRef.СпособыНумерации</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокРассмотрения</name>
    <comment>Плановый срок рассмотрения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокРассмотренияПервоначальный</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>EnumRef.ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Вопросы</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.Вопросы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтвета</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходящаяДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсходящийНомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодВопроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МнениеАвтораОМерах</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МнениеАвтораОРезультатах</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганДляПередачи</name>
      <type>
        <types>CatalogRef.ОрганыИУчреждения</types>
      </type>
    </attributes>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.Разделы</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатРассмотрения</name>
      <type>
        <types>EnumRef.РезультатыРассмотрения</types>
      </type>
    </attributes>
    <attributes>
      <name>Тема</name>
      <type>
        <types>CatalogRef.Темы</types>
      </type>
    </attributes>
    <attributes>
      <name>Тематика</name>
      <type>
        <types>CatalogRef.Тематики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Requests_control/src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <comment>Файлы в папках</comment>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <comment>Владелец файла</comment>
    <type>
      <types>DefinedType.ВладелецФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеУдалятьСтарыеВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <comment>Пользователь, занявший файл для редактирования</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтратегияРаспознавания</name>
    <type>
      <types>EnumRef.СтратегииРаспознаванияТекста</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияАвтор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияДатаМодификацииФайла</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияНомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияРазмер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияТом</name>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОснованиеДляСоздания</name>
    <comment>Шаблон файла, на основании которого был создан данный файл</comment>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯзыкРаспознавания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Requests_control/src/CommonModules/РаботаСОбращениями/Module.bsl
Функция НомерДокументаУникален(Объект) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	// ручная нумерация
	Нумератор = Нумерация.ПолучитьНумераторДокумента(Объект);
	Если Не ЗначениеЗаполнено(Нумератор) Тогда
		Если НРег(Объект.НомерДокумента) = НСтр("ru = 'б\н'") 
		 Или НРег(Объект.НомерДокумента) = НСтр("ru = 'б/н'") Тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Справочник.Ссылка
	|ИЗ
	|	Справочник.Обращения КАК Справочник
	|ГДЕ
	|	Справочник.НомерДокумента = &НомерДокумента
	|	И Справочник.ДатаДокумента МЕЖДУ &НачалоПериодаНумерации И &КонецПериодаНумерации
	|	И Справочник.ВидОбращения = &ВидДокумента
	|	И Справочник.Ссылка <> &Ссылка
	|	И Не Справочник.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НомерДокумента", Объект.НомерДокумента);
	Запрос.УстановитьПараметр("НачалоПериодаНумерации", НачалоГода(Объект.ДатаДокумента));
	Запрос.УстановитьПараметр("КонецПериодаНумерации", КонецГода(Объект.ДатаДокумента));
	Запрос.УстановитьПараметр("ВидДокумента", Объект.ВидОбращения);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

// Заполняет список (таблицу значений) файлов в карточке документа.
//
// Параметры:
//   Форма                    - УправляемаяФорма - форма документа, в котором заполняется список файлов
//   ЭтоСписок                - Булево - Истина, если обращение к функции выполняется из списка документов
//
Процедура ЗаполнитьСписокФайловДокумента(Форма, ЭтоСписок = Ложь) Экспорт 
	
	Если ЭтоСписок Тогда 
		Документ = Форма.ТекущийДокумент;
	Иначе 
		Документ = Форма.Объект;
	КонецЕсли;
	
	Если Документ.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	МассивФайлов = РаботаСФайламиВызовСервера.ПолучитьВсеПодчиненныеФайлы(
		Документ.Ссылка, 
		Форма.ПоказыватьУдаленныеФайлы,
		Истина); // НеПоказыватьОтветные
		
	ТаблицаФайлы = ПолучитьДанныеФайловДляСписка(МассивФайлов);
	
	Форма.ЗначениеВРеквизитФормы(ТаблицаФайлы, "Файлы");
	Форма.КоличествоФайлов = Форма.Файлы.Количество();
	
КонецПроцедуры

// Получает данные одного файла для обновления строки списка в карточке документа
//
// Параметры
//    Файл - СправочникСсылка.Файлы - ссылка на файл
//
// Возвращаемое значение
//    Структура - структура реквизитов файла
//
Функция ПолучитьДанныеФайлаДляСписка(Файл) Экспорт 
	
	СтруктураДанных = Новый Структура;
	
	Файлы = Новый Массив;
	Файлы.Добавить(Файл);
	
	Таблица = ПолучитьДанныеФайловДляСписка(Файлы);
	
	Для Инд = 0 По Таблица.Колонки.Количество()-1 Цикл
		ИмяКолонки = Таблица.Колонки[Инд].Имя;
		
		Если Таблица.Количество() > 0 Тогда 
			СтруктураДанных.Вставить(ИмяКолонки, Таблица[0][Инд]);
		Иначе
			СтруктураДанных.Вставить(ИмяКолонки);
		КонецЕсли;
	КонецЦикла;	
	
	Возврат СтруктураДанных;
	
КонецФункции

// Получает данные нескольких файла для обновления строк списка в карточке документа
//
// Параметры
//    Файлы - массив - массив ссылок на файлы
//
// Возвращаемое значение
//    ТаблицаЗначений - таблица с реквизитами файлов
//
Функция ПолучитьДанныеФайловДляСписка(Файлы) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Файлы.Наименование КАК Наименование,
	|	ПОДСТРОКА(Файлы.Описание, 0, 140) КАК Описание,
	|	Файлы.Ссылка,
	|	Файлы.ДатаСоздания,
	|	Файлы.Автор,
	|	Файлы.Редактирует,
	|	Файлы.ХранитьВерсии,
	|	Файлы.ПометкаУдаления,
	|	Файлы.ТекущаяВерсияРазмер / 1024 КАК ТекущаяВерсияРазмер,
	|	Файлы.ТекущаяВерсияРазмер КАК Размер,
	|	Файлы.ТекущаяВерсияДатаСоздания КАК ТекущаяВерсияДатаСоздания,
	|	Файлы.ТекущаяВерсияАвтор КАК ТекущаяВерсияАвтор,
	|	ВЫБОР
	|		КОГДА Файлы.ПометкаУдаления
	|			ТОГДА Файлы.ИндексКартинки + 1
	|		ИНАЧЕ Файлы.ИндексКартинки
	|	КОНЕЦ КАК ИндексКартинки,
	|	ВЫБОР
	|		КОГДА Файлы.Редактирует = &ТекущийПользователь
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РедактируетТекущийПользователь,
	|	Файлы.ТекущаяВерсияРасширение КАК Расширение,
	|	ВЫБОР
	|		КОГДА Файлы.ШаблонОснованиеДляСоздания = ЗНАЧЕНИЕ(Справочник.Файлы.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СозданИзШаблона,
	|	ПОДСТРОКА("""", 0, 255) КАК ПолноеИмяФайлаВРабочемКаталоге,
	|	ДАТАВРЕМЯ(2000, 1, 1, 1, 1, 1) КАК ДатаМодификацииУниверсальнаяВБазе
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КешИнформацииОбОбъектах КАК КешИнформацииОбОбъектах
	|		ПО Файлы.Ссылка = КешИнформацииОбОбъектах.Объект
	|ГДЕ
	|	Файлы.Ссылка В(&Файлы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Запрос.УстановитьПараметр("Файлы", Файлы);
	Запрос.УстановитьПараметр("ТекущийПользователь", ПользователиКлиентСервер.ТекущийПользователь());
	
	ТаблицаФайлов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ФайлыПисьмаСтрока Из ТаблицаФайлов Цикл
	
		Если ФайлыПисьмаСтрока.РедактируетТекущийПользователь = Истина 
				И ЗначениеЗаполнено(ФайлыПисьмаСтрока.Ссылка) Тогда
				
			ДанныеФайла = РаботаСФайламиВызовСервера.ДанныеФайла(
				ФайлыПисьмаСтрока.Ссылка);
			ФайлыПисьмаСтрока.ПолноеИмяФайлаВРабочемКаталоге = ДанныеФайла.ПолноеИмяФайлаВРабочемКаталоге;	
			ФайлыПисьмаСтрока.ДатаМодификацииУниверсальнаяВБазе = ДанныеФайла.ДатаМодификацииУниверсальная;
						
		КонецЕсли;	
		
	КонецЦикла;
			
	Возврат ТаблицаФайлов;
	
КонецФункции

// Помечает переданные в массиве файлы на удаление
//
// Параметры
//   Форма           - УправляемаяФорма - форма документа, в котором файлы помечаются на удаление
//   МассивФайлов    - Массив - массив обрабатываемых файлов
//   ПометкаУдаления - Булево - признак снятия/установки пометки на удаление
//   ЭтоСписок       - Булево - Истина, если обращение к функции выполняется из списка документов
//
Процедура ПометитьФайлыНаУдаление(Форма, МассивФайлов, ПометкаУдаления, ЭтоСписок = Ложь) Экспорт 
	
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Для Каждого Файл Из МассивФайлов Цикл 
		
		Если Файл.Редактирует = ТекущийПользователь Тогда
			РаботаСФайламиВызовСервера.ОсвободитьФайлПоСсылке(Файл, Форма.УникальныйИдентификатор);
		КонецЕсли;	
		
		ЗаблокироватьДанныеДляРедактирования(Файл);
		ОбъектФайл = Файл.ПолучитьОбъект();
		ОбъектФайл.УстановитьПометкуУдаления(ПометкаУдаления);
		РазблокироватьДанныеДляРедактирования(Файл);
		
	КонецЦикла;
	
	Если Не Форма.ПоказыватьУдаленныеФайлы Тогда 
		ЗаполнитьСписокФайловДокумента(Форма, ЭтоСписок);
	КонецЕсли; 
	
КонецПроцедуры

// Заполняет условное оформление пометки удаленных элементов в списке документов.
//
// Параметры:
//    Список - ДинамическийСписок - договорных документов.
//
Процедура СписокДокументовУсловноеОформлениеПомеченныхНаУдаление(Список) Экспорт
	
	УсловноеОформлениеКД = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
	УсловноеОформлениеКД.ИдентификаторПользовательскойНастройки = "ОсновноеОформление";
	
	Элемент = УсловноеОформлениеКД.Элементы.Добавить();
	Элемент.Использование = Истина;
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт",
		Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Ложь, Ложь, Ложь, Истина, ));
	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.Использование = Истина;
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	Отбор.ПравоеЗначение = Истина;
	Если РаботаСФайламиВызовСервера.ЕстьДублирующийсяЭлемент(УсловноеОформлениеКД.Элементы, Элемент) Тогда
		УсловноеОформлениеКД.Элементы.Удалить(Элемент);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет условное оформление пометки удаленных элементов в списке документов.
//
// Параметры:
//    Список - ДинамическийСписок - договорных документов.
//
Процедура СписокДокументовУсловноеОформлениеПросроченных(Список) Экспорт
	
	УсловноеОформлениеКД = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
	УсловноеОформлениеКД.ИдентификаторПользовательскойНастройки = "ОсновноеОформление";
	
	Элемент = УсловноеОформлениеКД.Элементы.Добавить();
	Элемент.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("TextColor", 
		ЦветаСтиля.ПоясняющийОшибкуТекст);
		
	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.Использование = Истина;
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокРассмотрения");
	Отбор.ПравоеЗначение = НачалоДня(ТекущаяДатаСеанса());
	
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("СрокРассмотрения");
	
	Если РаботаСФайламиВызовСервера.ЕстьДублирующийсяЭлемент(УсловноеОформлениеКД.Элементы, Элемент) Тогда
		УсловноеОформлениеКД.Элементы.Удалить(Элемент);
	КонецЕсли;
	
КонецПроцедуры

// Формирует строковое представление кода вопроса.
//
// Параметры:
//    Раздел - СправочникСсылка.Разделы - ссылка на раздел.
//    Тематика - СправочникСсылка.Тематики - ссылка на тематику.
//    Тема - СправочникСсылка.Темы - ссылка на тему.
//    Вопрос - СправочникСсылка.Вопросы - ссылка на вопрос.
//
Функция СформироватьКодВопроса(Раздел, Тематика, Тема, Вопрос) Экспорт 
	
	КодВопроса = "";
	
	Если ЗначениеЗаполнено(Раздел) Тогда 
		КодВопроса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Раздел, "Код") + ".";
	Иначе 
		КодВопроса = "0000.";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Тематика) Тогда 
		КодВопроса = КодВопроса + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тематика, "Код") + ".";
	Иначе 
		КодВопроса = КодВопроса + "0000.";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Тема) Тогда 
		КодВопроса = КодВопроса + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тема, "Код") + ".";
	Иначе 
		КодВопроса = КодВопроса + "0000.";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Вопрос) Тогда 
		КодВопроса = КодВопроса + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Вопрос, "Код");
	Иначе 
		КодВопроса = КодВопроса + "0000";
	КонецЕсли;
	
	Возврат КодВопроса;
	
КонецФункции

// Возвращает список вопросов по вводу по строке 
Функция СформироватьДанныеВыбораДелаХранения(Знач Текст) Экспорт
	
	ДанныеВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка,
			СокрЛП(Выборка.Индекс) + " " + Выборка.Наименование);
	КонецЦикла;
	
	Возврат ДанныеВыбора;
	
КонецФункции

// Возвращает список сроков рассмотрения обращений 
Функция ПолучитьСрокиРассмотренияОбращений() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокСроков = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СрокиРассмотренияОбращений.Код КАК Код,
		|	СрокиРассмотренияОбращений.Наименование КАК Наименование
		|ИЗ
		|	Справочник.СрокиРассмотренияОбращений КАК СрокиРассмотренияОбращений
		|ГДЕ
		|	НЕ СрокиРассмотренияОбращений.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокСроков.Добавить(Выборка.Код, Выборка.Наименование);
	КонецЦикла;
	
	Возврат СписокСроков;
	
КонецФункции
